#+TITLE: org-almanac
#+PROPERTY: logging nil
#+PROPERTY: ATTACH_DIR ~/org/data
#+PROPERTY: ATTACH_DIR_INHERIT t
#+OPTIONS: prop:("author" "published") toc:nil

# This file is exported to HTML at [[file:~/src/emacs/org-almanac/index.html]].

**** [[http://cachestocaches.com/2020/3/my-organized-life/][Gregory J. Stein: A Guide to My Organizational Workflow: How to Streamline Your Life]] :website:Emacs:Org:ATTACH:
:PROPERTIES:
:Attachments: http%3A%2F%2Fcachestocaches.com%2F2020%2F3%2Fmy-organized-life%2F--2hDjVP.tar.xz
:ID:       c5766d44-86f7-4bfc-b2ed-85d496ad6f12
:author:   Gregory J. Stein
:published: [2020-03-22 Sun]
:END:
:LOGBOOK:
CLOCK: [2020-04-26 Sun 01:23]--[2020-04-26 Sun 01:23] =>  0:00
:END:

[2020-04-26 Sun 01:23]

#+BEGIN_QUOTE
Five years ago, my life exploded in complexity. I had just started a new position in a new field. I was planning my wedding. And my inability to say NO to anyone and everyone had culminated in my serving on the board of three graduate student organizations. Inevitably, cracks began to form, and my finite brain started to lose track of tasks. My calendar was sufficient to ensure that I wouldn't miss meetings, but I would often only prepare for those meetings at the eleventh hour. My productivity and the quality of my work both suffered. Something needed to change.

This guide is devoted to a discussion of the organizational system that I have honed in the time since.Many of the ideas presented here derive from the Getting Things Done methodology, but adapted and expanded to meet my personal needs. With it, I have found that my time is spent more wisely. Better organization means that I can consciously devote effort where it is needed early on, as opposed to scrambling to keep up, and deliver higher quality work without expending more energy.

You too can streamline your process. This guide is meant to serve as an example of how you might reorganize your workflow and find order through the chaos of your busy life. Yet different lifestyles have different demands: what works for me may not work as well for you. As such, I do not expect that you will replicate this system in its entirety. Instead, I hope you will take inspiration from my system and use elements of it to build a workflow that works for you.
#+END_QUOTE

**** [[http://howardism.org/Technical/Emacs/getting-more-boxes-done.html][Howard Abrams: Getting Boxes Done, the Code]] :website:ATTACH:
:PROPERTIES:
:Attachments: http%3A%2F%2Fhowardism.org%2FTechnical%2FEmacs%2Fgetting-more-boxes-done.html--sQibSW.tar.xz
:ID:       c867cb2c-dd82-43e7-91aa-78e2839056cd
:author:   Howard Abrams
:END:
:LOGBOOK:
CLOCK: [2019-01-31 Thu 03:33]--[2019-01-31 Thu 03:33] =>  0:00
:END:

[2019-01-31 Thu 03:33]

*** [#A] [[http://orgmode.org/worg/][Worg]]                                                    :bookmark:
:PROPERTIES:
:ID:       90fe0f5b-8ecf-4078-81d1-344c537cdf04
:END:
:LOGBOOK:
CLOCK: [2015-08-29 Sat 15:02]--[2015-08-29 Sat 15:04] =>  0:02
:END:

[2015-08-29 Sat 15:02] There's a lot of good stuff here.

*** CHECK [[https://github.com/l3kn/org-el-cache][org-el-cache: Persistent cache for data derived from org-elements]] :website:Emacs:Org:
SCHEDULED: <2020-02-23 Sun>
:PROPERTIES:
:ID:       e52c02f9-9739-46f5-8a85-6330b32768ab
:END:
:LOGBOOK:
-  State "CHECK"      from              [2020-02-09 Sun 09:03]
CLOCK: [2020-02-08 Sat 08:28]--[2020-02-08 Sat 08:28] =>  0:00
:END:

[2020-02-08 Sat 08:28] 

